
#Область ПрограммныйИнтерфейс

// Возвращает сведения о внешней обработке.
Функция СведенияОВнешнейОбработке() Экспорт
    
    ОбъектМетаданных = ЭтотОбъект.Метаданные();
    
    ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке();
    
    ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиПечатнаяФорма();
    ПараметрыРегистрации.Наименование = ОбъектМетаданных.Синоним;
	Информация = ?(ПустаяСтрока(ОбъектМетаданных.Комментарий), ОбъектМетаданных.Синоним, ОбъектМетаданных.Комментарий);
	ПараметрыРегистрации.Информация = Информация;
    ПараметрыРегистрации.Версия = "1.0.0.0";
    ПараметрыРегистрации.БезопасныйРежим = Истина;  
    
    ПараметрыРегистрации.Назначение.Добавить("Документ.НаименованиеТвоегоДокумента");
    
    КомандаПечати = ПараметрыРегистрации.Команды.Добавить();
    КомандаПечати.Идентификатор = "НаименованиеКоманды";
    КомандаПечати.Представление = НСтр("ru = 'Наименование команды'");
    КомандаПечати.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
    КомандаПечати.ПоказыватьОповещение = Ложь;
    КомандаПечати.Модификатор = "ПечатьMXL";
    
    Возврат ПараметрыРегистрации;
    
КонецФункции

Процедура Печать(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм, 
		"Макет", 
		"Шаблон внешней печатной формы", 
		СформироватьПечатнуюФорму(МассивОбъектов)
	);
	
КонецПроцедуры

Функция СформироватьПечатнуюФорму(МассивОбъектов) Экспорт
	
	ДанныеПечати = ДанныеПечати(МассивОбъектов);	
	
	Для Каждого ОбъектПечати Из ДанныеПечати Цикл
		
		СтруктураПараметров = Новый Структура;
		ЗаполнитьСтруктуруПараметровШаблона(ОбъектПечати, СтруктураПараметров);	
		
		ТабличныйДокумент = Новый ТабличныйДокумент;	
		
		Макет = ПолучитьМакет("Макет");
		
		ОбластьШапки   = Макет.ПолучитьОбласть("ШаблонШапки");
		ОбластьШапки.Параметры.Заполнить(СтруктураПараметров); 
		
		ТабличныйДокумент.Вывести(ОбластьШапки);
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		ТабличныйДокумент.АвтоМасштаб = Истина;
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий
// Код процедур и функций
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеПечати(МассивОбъектов)

	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса();
	Запрос.УстановитьПараметр("", );
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
	
КонецФункции

Процедура ЗаполнитьСтруктуруПараметровШаблона(ОбъектПечати, СтруктураПараметров)
	
КонецПроцедуры

Функция ТекстЗапроса()
	
	Возврат "";
	
КонецФункции

#КонецОбласти

#Область Инициализация

#КонецОбласти